tests/fixtures/webhooks/billing_statement.paid.json

{
    "id": "evt_qwavSjFVEzrSWpf99kqpdLY1shFxJvDD",
    "resource": "event",
    "type": "billing_statement.paid",
    "data": {
        "id": "bstm_cCWmfBcXHZncypdZwUfvWZcTyGxDd9mE",
        "resource": "billing_statement",
        "amount": 50000,
        "currency": "PHP",
        "customer_id": "cus_Rtetr77KxMeLDd6FGjCPnw1mJnZcq576",
        "description": "Updated description",
        "due_at": 1774404413,
        "finalized_at": 1773799632,
        "billing_statement_merchant_name": null,
        "billing_statement_number": "Z5VKFCVU-0001",
        "billing_statement_url": "https://bill.payrexhq.com/b/test_bstm_cCWmfBcXHZncypdZwUfvWZcTyGxDd9mE_secret_Fza1Ao99UbERArDr9vtpHpjPCtSzDPjPoz8nFfB2sv9E8kYksL",
        "line_items": [
            {
                "id": "bstm_li_UC4SdwgrSDWBmCcLFini5gz7HkvLUZkM",
                "resource": "billing_statement_line_item",
                "description": "Line Item 1",
                "billing_statement_id": "bstm_cCWmfBcXHZncypdZwUfvWZcTyGxDd9mE",
                "livemode": false,
                "quantity": 1,
                "unit_price": 50000,
                "created_at": 1773799597,
                "updated_at": 1773799597
            }
        ],
        "livemode": false,
        "merchant_id": "merc_XNNXbTz2n4UAigUwdPRdPqYUk61vvBDW",
        "statement_descriptor": null,
        "status": "paid",
        "metadata": null,
        "customer": {
            "id": "cus_Rtetr77KxMeLDd6FGjCPnw1mJnZcq576",
            "name": "Test Customer",
            "email": "test@example.com"
        },
        "payment_intent": {
            "id": "pi_SBJinosUNfwGFWMoS4wMgJ9hx8hZ7ryy",
            "resource": "payment_intent",
            "amount": null,
            "amount_received": null,
            "amount_capturable": null,
            "client_secret": "pi_SBJinosUNfwGFWMoS4wMgJ9hx8hZ7ryy_secret_kdk3CKbcmLZ7MFUqNUuMvqP3jJgiFmQE",
            "currency": null,
            "description": null,
            "last_payment_error": null,
            "latest_payment": "pay_4dtfeLDeaysz1guM89uFhdJBnJZx7aoh",
            "livemode": false,
            "metadata": null,
            "payment_methods": null,
            "payment_method_id": null,
            "payment_method_options": null,
            "statement_descriptor": null,
            "status": "succeeded",
            "next_action": null,
            "return_url": null,
            "created_at": 1773799632,
            "updated_at": 1773799669
        },
        "payment_settings": {
            "payment_methods": [
                "card"
            ]
        },
        "created_at": 1773799597,
        "updated_at": 1773799669
    },
    "livemode": false,
    "pending_webhooks": 1,
    "previous_attributes": {
        "status": "open"
    },
    "created_at": 1773799670,
    "updated_at": 1773799670
}
